Layer (type)                 Output Shape              Param #   
=================================================================
mfcc_input (InputLayer)      (None, 1, 130, 40)        0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 1, 130, 40)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 130, 40)       160       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 43, 40)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 43, 40)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 30, 43, 40)        4350      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 30, 15, 40)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 30, 15, 40)        160       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 15, 40)        17344     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 8, 20)         0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 64, 8, 20)         80        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 30, 8, 20)         17310     
_________________________________________________________________
batch_normalization_4 (Batch (None, 30, 8, 20)         80        
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 8, 20)         4336      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 16, 4, 10)         0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 4, 10)         40        
_________________________________________________________________
flatten_1 (Flatten)          (None, 640)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 640)               0         
_________________________________________________________________
mfcc_output (Dense)          (None, 10)                6410      
=================================================================
Total params: 50,430
Trainable params: 50,170
Non-trainable params: 260
_________________________________________________________________